[[{"review_date": "2018-08-19", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 23, "review_title": "\n        ", "review_body": "Until about 2 months ago, this phone was fantastic. But then the problems started: Overheating, random restarts (I keep very little in terms of apps or data directly on the phone, pulling it from the cloud whenever possible to try and mitigate this very issue). Recently however, this phone, which was supposed to be refurbished as new, completely died.I was looking at a website (text-based) when the phone froze, overheated to the point that it was more than a little bit uncomfortable to hold and then blacked out. I let the phone \"charge\" for several hours with no change. I've been told by a repair shop that this something that they cannot fix.This is unacceptable that a phone that costs $500 cannot seem to handle 6 months of regular use (Pandora and GPS while driving, and occasional web browsing while idling at my desk)\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RQF1E62AY38XL?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-03-26", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 19, "review_title": "\n        ", "review_body": "Bought this for my wife, who had been using a Galaxy S5 for a few years. She has been using the Pixel for a couple of months now and she really likes it. The transfer of her contacts etc from the old phone to the new was pretty seamless. We did have to go to the AT&amp;T store to have the SIM card trimmed to fit the Pixel. She doesn't do many games, but she takes a lot of photos of our pets. Having the link to the cloud is nice so she doesn't burn through all memory. She hasn't had any problems with the processing speed.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1RD019DY1AXV7?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-02-02", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 16, "review_title": "\n        ", "review_body": "So far, after 2 days, this phone makes me a believer in Google phones. I will NEVER go back to Samsung or LG phones.I have also signed on to Google FI project and receive 5 bars of service where Verizon only gave me 2. Highly recommend FI\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2O2CTHSFZFR1?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-09-13", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 8, "review_title": "\n        ", "review_body": "First I have to say that I'm extremely impressed with the service and product I recieved from GizmoTrader. The phone was in excellent condition as promised by the pics and when a small issue arose with the charger they sent me they immediately made things right by issuing a partial refund so that I could purchase another adapter asap. They're very consumer-friendly and they go the extra mile to take care of you.That being said, the Pixel XL itself is a wonderful device. If you have any reservations based on the fact that the phone is nearing two years old, they'll be dispelled once you get it in your hand. The screen is colorful and vibrant with deep blacks that only AMOLED can provide, the 3450mah battery delivers extended on- screen time, stock Android is snappy and responsive, updates come immediately, Android Pie is a nice upgrade over Oreo, 128GB of storage will last you a long time (I have 15 AAA mobile titles installed as well as over 8GB of music and I still have over 100GB remaining), the build quality is excellent and the semi-glass back helps radio reception a great deal. It has wifi calling, VoLTE, and so much more.And I haven't even addressed the camera yet. It's easily one of the best in the business. The Augmented Reality (AR) stickers allow you to place a 3D lifesize Stormtrooper in your livingroom and video him while he interacts with you and tracks your movements. You can put R2D2 in your bathroom, or Pogs in bed with you. It's amazing.You can customize stickers that look just like you and send them via MMS.But the camera; you have to research it for yourself, don't take my word for it. Sometimes I just take the Pixel out on family outings and leave my DSLR at home. It's especially impressive in low light situations where the HDR shines through.Add to that unlimited free cloud storage for all your photos and video, even 4K video.I'm sure I'm leaving out a ton of things about this phone but this review is a bit long already as it is. If you want a fast phone with the latest OS and a pro-level camera than grab the Pixel XL and don't look back. Then have fun chuckling to yourself when you see others with their overpriced Apple or Samsung devices that are still running last year's software.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1PHTDEL1Q2NAQ?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-09-26", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 8, "review_title": "\n        ", "review_body": "Paid under $400 for new unlocked Pixel XL 128gb smartphone.  As soon as I started it up and connected to my WiFi, it upgraded to Android 9 (Pie).  Device is very fast, runs circles around my Samsung Galaxy S7 Edge.  Apps start quickly and menu selections load almost instantly.  Even though this phone is using 2016 hardware, it easily matches top of the line phones from 2018.  Very happy with my purchase.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2075TJPH0UCL6?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-06-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 10, "review_title": "\n        ", "review_body": "Great phone overall. Camera quality to me was 100 times better than the camera I had on my old iPhone 7 plus. Unfortunately the battery was bad on the refurbished unit. It went from 100% to 75% in 15 minutes. With no use at all during the process except for a quick 5min phone call.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R79U842K32QQI?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2018-12-21", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 7, "review_title": "\n        ", "review_body": "My wife had her phone die in Sept. 2018.  We purchased a BRAND NEW Google Pixel XL 128 on Amazon that evening thinking that it was coming form Google.  The phone arrived on time and everything was fine.  Fast forward 3 months to a week before Christmas, she woke up to a DEAD PHONE.  I contacted Amazon and they referred me to Google Warranty Providers who informed me that the phone had NO WARRANTY.  I tried for 3 days to contact the reseller and have not heard so much as a missed call, email or anser to the ticket I put in.  If you are expecting any type of warranty on this product, you should NOT BUY THIS.  Google refuses to do anything, even though they are required by law to stand behind their manufactured products, the seller is MIA and Amazon still allows them to sell.Google has at least escalated me to their technical team and I will update when I hear from them.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R34S5SFJOX1S5M?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2017-05-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 16, "review_title": "\n        ", "review_body": "I was previously on a Windows Lumia 830. I thought migrating to Android and Google Pixel would be a massive step up  - in terms of speed of the OS switching between apps (response lag) and in terms of the phone quality itself. It turns out that the Windows OS is superior to Android - way better in fact - but of course no one makes apps for Windows...and Google navigation is great amongst other apps of course. ANyway, the phone is fast, but not lightening fast in terms of switching between apps and opening apps. But it does not frustrate - it is fast enough.The camera is awesome. 5 stars there.The fingerprint scanner is also excellent. The Pixel does not come preloaded with all the junk they load on Samsung, which is great. The S8 may be an object of beauty, but I wanted a phone that does not slow down due to apps overload and software layering. The Pixel has a an excellent build quality. Yes the screen does not curve to the edges, but so what. The phone works well, the signal strength is good. Chrome loads fast and the browser loads pages fast. VOice clarity on the phone is superb. I still need my phone to be a phone, and it does a great job in that area.Would I buy it again? Yes. Note - this phone was shipped to South Africa. It works 100% perfectly on any network here. Loud and clear, and fast on LTE.Note to the shipper - the packing was dismal. The box had no bubblewrap or any cushioning inside it. Very poor packaging. But the phone did arrive on time and DHL provided an awesome service.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RKWLK7425PA2?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2018-09-12", "review_body": "So my first Pixel XL was a refurb (from another seller) and I was very happy with it, however, the GPS quit working.  I was within the return period so I sent it back for a full refund and set out to find another replacement.  I was leery of getting another refurbished but I came across the listing for an \"unlocked\" Pixel XL that Abe's had listed.  It was just slightly more expensive than the one I returned but much to my surprise, the one I received was BRAND NEW in a sealed Original Google Pixel box with all the cables and documents - which my original refurb did not come with.  Everything works great and the whole process of restoring my content from my original Pixel XL to my new one was painless due to the built in backup process that the Pixels have.So, even for an older phone, the Pixel XL is still a great phone. Battery life is stellar, and seems to have improved with the latest version of android \"Pie\".  Features are great and the camera is still better than most.  I had a LG V20 on Verizon but switched to Project Fi, so it wouldn't work.  It had a great camera and some really impressive multimedia features but I really don't miss them with the Pixel.  Battery life on the pixel far surpasses that of the V20.So, thanks Abe's for sending me a great replacement phone!\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R15NQSAWQ4V8S5?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-10-08", "review_body": "I love everything about this phone even the styling which many reviewers have criticized. The build quality is excellent and the android experience is super fast. Transfer from my LG G2 was painless and I could really see the difference between the phones once I was up and running. The camera is super fast to focus and now does not leave me frustrated. I can easily take in focus pictures of my non-stop 3 year old. Bought an older phone simply for the cost savings and I don't regret that I bought this phone when the pixel 3 is about to be released. I forgot to mention that the phone updated to Android Pie immediately! So this phone is getting the latest android software updates before any other android devices other than other Pixels! That is so neat.\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1TUVOWUZ68GPI?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-03-14", "review_body": "This phone has been great. I bought it as an upgrade from my old Nexus 6 after a fatal drop. It arrived charged and ready to use, and I was able to make calls as soon as I swapped my SIM card. The camera is excellent. And I'm very happy with the latest Android OS.\n        ", "review_helpful_votes": 8, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3AWARGOWMQY98?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-31", "review_body": "When this phone first came out, I wasn't interested because it didn't support wireless charging and didn't have an SD slot.  So my wife and I went to Samsung.  My daughter's LG G5 finally died and I needed to get her a replacement, quickly, and at an affordable price.  When I saw this at the price it was offered for, I was shocked!  The \"burner phones\" you get from ISPs aren't anywhere close to as good as a Pixel XL.  We ordered it and haven't been disappointed.  It's fast, comfortable and has a great screen.  Sure, not as good as a Galaxy S8 or S9, but it's 1/4 the price!!!  My daughter has been very happy with the phone.  She hasn't complained once since receiving it.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3VTG41QRNR19V?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-09-14", "review_body": "Like everything except the fact google is going to stop updating pixel next October. Not the sellers fault but should be disclosed in the description. I would have bought the pixel 2 xl instead. Now I have an expensive phone only good for one year.\n        ", "review_helpful_votes": 4, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R34K93D294O25U?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-01-19", "review_body": "I really like this phone, great battery and all the latest OS updates. It gave me a slightly different look than my HTC M9 but after a couple weeks I am very happy....... perfect screen size for me.  Works great on the T-MOBILE network.\n        ", "review_helpful_votes": 5, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1S1BCAKGDIZF3?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-10-11", "review_body": "Awesome phoneArrived on time, with all the cords and adapter to download my old phone.Just used my own sim card and phone was ready in a short time\n        ", "review_helpful_votes": 7, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1FCZZ2I7IBJ8N?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-11-05", "review_body": "The Google Pixel phones are the best devices and work seamlessly with all the Google apps.  Very easy setup.  Best phones I've ever owned or used.\n        ", "review_helpful_votes": 5, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R12WJZ2DB6IPYA?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-11-07", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Phone came very fast and safely via UPS. It's packaged with a charging cord (USB type C), charging block, and a micro to USB C adapter. It is the Pixel XL first gen as described and completely unlocked. All I had to do was get a new sim card and transfer my service. Transferring my data from old to new phone was easy with the adapter.  Phone is in brand new condition. My only complaint is that it came with a serial/IMEI identification sticker directly on the back and i had to use baby oil to remove it. Amazing vivid camera and high quality video. Sound is good for me I just find the speaker is easy to accidentally cover up. By far the best phone I have ever had!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3P2SH90OEGAF1?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2019-02-28", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I purchased this phone 14 months ago,and after having only dropped it one time,more than 6 months ago,the glass screen is literally seperating from the entire phone.  It is lifting up and about to come completely off.  I work on the phone,so I use it frequently throughout the day.  It always gets extremely hot,to the point that months ago,I had to remove the case.  Now,due to the extreme heat,the glass is lifting.  I am extremely disappointed and though most everything else about it was fine, It did not take the best of pictures.  But now with  this, it very well may be  the last Google product I  ever own.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3UZD2HZN67E32?ASIN=B01M01ZZAC", "review_rating": 3}, {"review_date": "2018-09-22", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 3, "review_title": "\n        ", "review_body": "I purchased my Google Pixel XL Phone in April and in September I could no longer make an outgoing phone call without the screen turning totally black.  Imagine how many times you make a phone call and have to use your keypad to press \"option 1, 2 or 3\" etc.  Basically, my phone is now useless.  I spent a significant amount of money for a phone that I can no longer use &lt; 6 months later.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R9P4DFAJL9SL5?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-05-08", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 3, "review_title": "\n        ", "review_body": "OMG love this phone-in is great, good battery life and SO MUCH STORAGE!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1VFW6JACO0COQ?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-07-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Purchased a refurbished like new device from SFL Mobile. I have had it for over week and it looks perfect and works flawlessly. I only gave 4 stars because for some reason it came with a Samsung USB A 10watt charger. I have an 18watt USB C charger from another device so this was not problem foe me.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R157T0HQTQDLDS?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2018-03-01", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 4, "review_title": "\n        ", "review_body": "Really like this phone it runs smoothly and over love the feel and layout. Only thing I had to was get a Sim card for at&amp;t took all of 2 mins in store\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3DLA2ZW6BTVM0?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-02-06", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 3, "review_title": "\n        ", "review_body": "Received mine as described in Used - Very Good condition.  No visual marks on the screen or camera but a small scuff on the metal frame that my case covers easily.  Great phone for the money!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3HZJXMDKV5CGY?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-11-25", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "The battery seems to drain somewhat quickly, but can make it through the day with general use. Not sure how it initially performed, but being two (+) yrs older likely doesn't help. That, and a finicky tap to wake feature are the only drawbacks thus far. It's exceptional otherwise, and has an increasingly rare 3.5mm output.This was initially going to be for temporary use, but while still receiving updates and barring any unforeseen issues, there's no reason not to deviate from that plan for now. Very pleased with this phone.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3OOHWSW4QM6HU?ASIN=B01M01ZZAC", "review_rating": 4}], [{"review_date": "2019-01-06", "review_body": "Was sold as refurbished and is clearly not. Screen has huge scratch on the top front about 1\" long, multiple deep scratches on the back into the metal, and battery life on standby with no background apps active Bluetooth and wifi off dropped over 40% in 6 hrs.And last but not least after upgrading it to the most current version that should fix the known charging issues...doesn't in fact the phone gets hot enough to burn me within 10-20 sec. on a certified PD charger which the phone is meant for. I'm probably going to have to RMA under the 90 day warranty which I hope they honor!\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 2, "review_source": "https://www.amazon.com/gp/customer-reviews/R2JVX6UN9R1ZOL?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-09-21", "review_body": "How do I love thee? Let me count the ways: 1 for the XL size that allows me to see my content without being heavy 2 for the crystal clear display 3 for the awesome operating system, 4 for the apps.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1E0KKWA3JRA18?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-12-19", "review_body": "Both Wifi and Bluetooth were BRICKED upon receipt.  This was supposed to be a FULLY TESTED phone prior to shipment.  Spent an hour plus with Google phone support who couldn't get it running.  Seller came back claiming all their perceived problems associated with Pixel XL and that once something starts to happen the phone goes down hill fast.  I'm the original owner of a Pixel XL, NO issues, NO problems (until I cracked the screen).  Beware when buying used, and BEWARE of who you buy it from.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R234MPPD99RU31?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-12-08", "review_body": "Received the phone super quickly. The description said minor scratches but the phone arrived seemingly brand new with a tiny scratch at the top that wouldn't have bothered me anyway if it had been new. Thanks! :)\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1Y4JKX1AVOSJI?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-08-14", "review_body": "Fantastic phone! Ultra fast, smart and the fast charger is a blessing!\n        ", "review_helpful_votes": 4, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2LUGEMPK70WJ8?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-04-13", "review_body": "This product sucks. I dunno if it's Pixel XL or the Synergy the company that's selling it, but my phone craps out ALL the time. And this is happening 2 months into buying the new phone. Brand new phone apparent.y. I don't use my phone much, there's enough memory on my phone and even the few apps that I use blank out every second. Very disappointed.\n        ", "review_helpful_votes": 8, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R5FWF4HKEVWX3?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-11-04", "review_body": "So far so good. I have only had it for a week. I am happy that it was easy to operate and set up. The pictures I have taken so far have excellent quality. Glad I didn't pay close to a thousand dollars for the newer model. This work's just fine.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2JZWPZO8ZCT3V?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-04-04", "review_body": "Phone itself is fine, but the battery life is much worse than expected. Is this a refurbished phone?\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 2, "review_source": "https://www.amazon.com/gp/customer-reviews/R24XW82Z6SQ81W?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-10-23", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Bought this as a gift for an android-loving wife of mine. This product is in-the-package new and works great. She can't stop talking about the camera, fast processor (i believe she has the new android Pie software update), and screen size. Definitely a great alternative/superior product to the iPhone 7 Plus (coming from an iPhone guy myself).\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RMM1QQ5HWJKZ9?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-10-08", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Phone is quick, battery is good, and there is tons kf storage.  I upgraded from a Note 4, and I am 95% happy.  I miss the precision of the s-pen for writing on pictures (well, mostly screen shots of maps),but otherwise It has been great. Camera has been excellent also.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3EPZ63AHVFZQL?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-04-21", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 2, "review_title": "\n        ", "review_body": "Didn't like the cable that came with it but phone was very neat and perfect\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2BAFNWN6GPX4L?ASIN=B01M01ZZAC", "review_rating": 3}, {"review_date": "2018-10-16", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 2, "review_title": "\n        ", "review_body": "Well purchasing this pixel xl while on backorder from amazon.com, description read 1 year mfg warranty, but not true, its only for 90 days\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1N2PKZDU0LBBR?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-11-11", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Does everything you expect from a smart phone (including that fruit one) at a fraction of the price. Battery usage has to be monitored as leaving certain apps running will deplete it quickly.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RHD3KEAIDYTKT?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-03-07", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 2, "review_title": "\n        ", "review_body": "I thought the item was new but it was refurbished.  I may have misread the ad but the phone is working well. The charger that came with it broke after about a month of use, so 4 stars due to low quality cable.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3C9X552FCZJRZ?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2017-10-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Great phone, bought for the wife and she loves it  Pics are great and that was the main selling point\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2AQTPWQAZJLC7?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-05-14", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Google pixel is great! especially the camera is the best with realllllly good image. Best phone among all.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2D91F07B6ZBEB?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2018-02-27", "review_body": "Overall this is a great phone.  There are w few quirks that are annoying such as the delay time when trying to close out a window.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3R3TB436M420W?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-10-18", "review_body": "Awesome, still great a year later\n        ", "review_helpful_votes": 4, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R4C0P2MA9F0V5?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-02-16", "review_body": "The camera capabilities could be better. Editing capabilities are sub par so you have to get an external editing app. The phones standard apps could be better as well. The google apps are lackluster and you need to get external apps to be able to do most things on it. Google music sucks.The battery life is good. The phone itself is good quality. It’s just not like other phones that are easier to use.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R2749H3WSXAM7Z?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-10-12", "review_body": "The product is not unlocked. I cannot activate it to my Virgin Mobile service. DO NOT BUY! It had a Verizon SIM card in it.\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R3IILLF65T7YQP?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-12-10", "review_body": "We are very happy with the purchase of this phone.  It has met or exceeded our expectations.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1J59CX0EKS71A?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-09-05", "review_body": "I love the size of the phone and the 128 GB of internal storage. I have plenty of space for my apps and then a bunch. The battery life lasts me at least two days, and I love listening to music and videos on YouTube with the excellent sound quality. As for the customer service, my package arrived before the earliest expected delivery date.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R23SXGD8Q732P6?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-11-23", "review_body": "Excellent product, was received as described, was delivered at the correct time.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R8VABLUODXRQY?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-10-20", "review_body": "Still have the fone two years later\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3JRXHTC7QNBBL?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-12-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Wish I could have afforded the new pixel 3\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R35R51AIUCAM3W?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-11-01", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "It's The Perfect Phone! And I have had many.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1WHEFU7L8F14N?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-10-18", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "Purchased a Pixel XL from BuySPRY and was incredibly reluctant to do so via third party, but everything came brand new, in the box as described and I'm happy. Much appreciated.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R185LU6CEO87J0?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-12-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Is awesome this phone works great\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RLMB0D9JK6E63?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-12-26", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Absolutely love this phone! It sleek, easy to use, and good color. I was originally considering getting a samsung galaxy of some sort but I would 100% recommend getting this over it. It has great picture quality as well!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2SXPIIOR89OOZ?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2019-01-28", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Great phone in great condition. There was some screen burn in which is to be expected.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R294EHN7FY5SS4?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2019-01-10", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Great\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R7SEVV9HERZN0?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-12-12", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Everything looks very good and exactly as it mentioned in the product specification. The battery life might be a problem, I need to recharge my phone once a day. But I guess that's also normal to a old phone.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RZMY8EJFPRQIV?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2019-01-20", "review_body": "the voice navigation doesn't work. That has been a hassle. Other than that though, this is a great phone.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 3, "review_source": "https://www.amazon.com/gp/customer-reviews/RIPHVLYE8YMIZ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-03-15", "review_body": "The phone either won't hold a charge, or both of the chargers that came with it are faulty. Other than that, it's been working fine so far.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 2, "review_source": "https://www.amazon.com/gp/customer-reviews/R2AK0CW0WHPSIG?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-08-08", "review_body": "Overall, this product is in very good shape, until I turned to screen on to find a VERY severe case of screen burn. I am trying to fix it now, but this is the 2nd time I've made an attempt to purchase this phone from Amazon but I just keep having problems.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 2, "review_source": "https://www.amazon.com/gp/customer-reviews/R1YZI4WJKFLLBW?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-10-02", "review_body": "The phone I received is brand new, purchased mine from Abe's electronics. Great phone for the money buttery smooth.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1QYBYVSQJOICS?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-08-10", "review_body": "Nice cell phone I recibe a black one no the color blue that I ordered, but it's like new\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R1UY94YQJP5YHZ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-08-31", "review_body": "This a great unlocked phone, pure Android pure Google, nothing else.Do not need more.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2RH64FONINOIJ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-06-13", "review_body": "Working good , good condition . Looks new. I used to buy  from Google first day , it's my secondary same phone. So good offer , super price\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R29VXRCQ7WL700?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-10-07", "review_body": "Had some bugs to work out when new\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R3CVQIVAUEG1XO?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-06-12", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Love it!! Super phone great camera\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2AHYDQ4OMTUOS?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-10-08", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I like it\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R109CM8AT3WZZG?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-03-26", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Great product!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R12L8OLSUEP6Q2?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-07-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Great phone! Great camera! I also have a Google Chromebook and I LOVE my Google products!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1CUBM47YPWF3T?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-02-27", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "The camera and app is terrific. Would go 5 stars but then nothing is perfect. The phone is as good as I need.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2FA4V9OI2EAOD?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2019-01-16", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I like Google product, their android so fast camera the best of the best I am looking forward to buy pixel 3 plus if I get a chance .\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2KCXU06WET3VW?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-05-16", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Absolutely love!!! I've had this for a couple months now and my only complaint are those ads that randomly show up oh my phone. Awesome camera quality and very durable, I bought an OtterBox for it and I have no issues.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R8OMIIN92N69R?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2019-02-14", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I love everything about this phone. It's brand new and lightning fast. The delivery time was as promised one day delivery. I will definitely use this seller again.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R175QXR1EM14QL?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2018-11-17", "review_body": "Love it\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R13YNTMB4WTSO9?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-09-15", "review_body": "I spent the extra money for a new one and I am very pleased everything is crisp and new and it came with all attachments and wires. Will post updates on proformance over time.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2NMZ30RFQUER0?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-05", "review_body": "I love this phone I would buy it again\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2GVLIGOPBXVMJ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-08-15", "review_body": "The phone is like new, very happy.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R7X67XWSYFUYR?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-05-19", "review_body": "I love the Google pixel it's a great phone I have project fi as my carrier I need it unlocked phone my Nexus 6 was acting up I want to replace the Nexus 6 if it wouldn't have been acting up. Which project fi you can only use Google phones. I love Google pixel with the unlimited photo storage it feels good in my hand it's smaller than my Nexus 6. But it's definitely a quality phone especially with Android 9.0 it's really nice with Android P running.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R2IW31IKIF5TQ3?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-03-11", "review_body": "This is my very 1st smartphone, I love it\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R19MSXD4G3A2ZV?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-12-04", "review_body": "Love this phone and happy with all that I went through to get this. Great buying and great product.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1V7V48Q5NO2WZ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-18", "review_body": "The speed at which it was delivered was great. The phone has done everything and more of what I needed and expected. Thank you\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/RTCT6LNJJL9LV?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-11-17", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Was what I wanted and expected, a pure Android phone  without cell phone carrier garbage on it, works like a champion.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R9P5FCDAFRB85?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-08-11", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Phone no good\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R11CDX81NX1PHX?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-02-19", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 5, "review_title": "\n        ", "review_body": "Phone was great but camera is broken. A big let down because I bought it because of the supposed great camera.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RT42WCVZ5TFQI?ASIN=B01M01ZZAC", "review_rating": 2}, {"review_date": "2018-05-04", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I love my pixel!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R17YRHP9QSBN4T?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-12-19", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I like it's battery. With average use it lasts about 15 hours or more. Hope it will stay like that\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3TPYKUC8NCBCS?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-09-14", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "What's not to love,!!!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R181M24QFU2JGV?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-10-03", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "This is a great phone to buy. I think you get high end features for a low price.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R15H9T17HDHPIP?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-03-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 5, "review_title": "\n        ", "review_body": "This pains me. I had such high expectations for this phone. I mean, considering the price you're paying, you should, right?Nah.Upon arrival, I opened the shipping box, and pulled out the glorious white Google Pixel XL with 128GB box. The tape on the sides was already split. There my OCD was disappointed, but I was also irritated because clearly, someone opened it before it was sent to me. Now. I went through the set up, everything was smooth, even downloaded my wallpaper from my old phone. I was impressed! The photos were just incredible. I was stoked!Then. Someone sent me an MMS message. And it WOULD NOT download... And when I went to send one from my phone to a friend, the MMS would never go through. I also noticed that during the time that I had it, it would get very hot when charging. And would also get hot when in use for 10 minutes or more. And yes, I was using -THE- charger that came in the box with the phone. I contacted Google. But they were no help, as I had purchased through Amazon...Maybe you will have better luck than me. But this was my second return of this phone to Amazon as the first purchase was refurbished. Heck, by the time I finish finding the perfect phone for myself, I probably could have just bought a brand spanking new one from Google themselves for the amazingly robbing price of $900 with all the return shipping fees I'm paying.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RFOXERYSR9MSU?ASIN=B01M01ZZAC", "review_rating": 3}], [{"review_date": "2018-12-08", "review_body": "Camera is excellent and so it the video stabilization, very high resolution display\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R9SQJN1AZGE91?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-05-02", "review_body": "I love this phone!\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/RJ2B95NYS2P4I?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-09-03", "review_body": "I am very happy with my purchase , product was brand new , not a scratch or blemish\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1NEJZKNBSONMM?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-12-30", "review_body": "Me siento satisfecho con la compra del celular.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1U2EI8V8OYLR9?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-02-14", "review_body": "None\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/RUDQ7QMSUPEHG?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-06", "review_body": "Home button stop workingWiFi doesn't stay connected\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R1X3ZS8QO5DPZ9?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-15", "review_body": "The phone came exactly as seen in the photos and as described. Thanks.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/RD3IWB5XB8JY6?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-02-23", "review_body": "Works perfectly fine, minimal surface scratches, no dents or major damage. Only like three hair-sized scratches on screen, no biggie. The ONLY issue I have is that only one of my speakers works. I didn't say anything about it because I often use headphones, and the sound still does work perfectly through the one speaker. I mean, for the price, I'm perfectly happy. I'd be ecstatic if there were no scratches and both the speakers worked.\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R22VNORNDXPEXH?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2019-03-03", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Everyone says I really got a good deal.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2EES94KRMYAN5?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-10-31", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Still getting used to format.  Great quality.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1A7IOZ4XQLMV5?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-08-09", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "very good!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2QP5HKJG836WF?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-08-04", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "As described.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3Q5FB55B4AVEN?ASIN=B01M01ZZAC", "review_rating": 4}, {"review_date": "2018-11-24", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Gran teléfono con gran performance\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2NL2F0149D4Y3?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-08-08", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "I love it\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3S6XND8XW72EI?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-02-09", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 11, "review_title": "\n        ", "review_body": "Amazing phone by Google's first attempt to creating a phone from start. HTC built these phones but Google designed and over looked the whole process. I'm a avid Samsung user for the past 7 years and wanted to get my teeth into something different. Not only that, but also wanted to be apart of yet another technical milestone this phone will create. Upping the game for all other manufacturers to do better. Pros and cons on the phone.Pros:Material is metal and Gorilla Glass 4. Not glass covered so their is some texture so the phone won't fly out of your hands if not in a case.Super fast! This phone is quick, fastest processor in the market now for smart phones. Very silky performance. Runs like a Samsung 7 when animation is turned off.If you get the XL, battery life is amazing. The XL comes with a bigger battery and screen of course. We will see how long it lasts, but for now does not get hot at all, and battery life definitely runs over the 8 hour work day with heavy usage.Works flawlessly with Google Play apps, and Google hardware. Chromecast Ultra is awesome with that device, and I'm excited to match this up with Google Home in the near future.Google Assistant is honestly the best verbal command app I've ever seen. Very responsive,and you do not need to speak to it like it is a robot. Can figure out what you want even though you may get a little tongue tide and give a few extra \"ummms\" and 'aaaa's\" she will still pretty much get you to where your going.Kind of a pro and con. You will have to switch all your cords to the USB C connector. Finally did away with the Mini USB that constantly break all the time.Camera is the best I've seen in any phone. Front and back. Stabilisation makes your movies look professional quality.Unlock button at the rear of the phone, placed where your index finger naturally resides is awesome. Fingerprint scanner is super quick and accurate.Cons:No expandable memory. Highly recommend getting the 128gig. Although when you purchase the phone you have access to the Google Cloud service and can save all your HD and 4k media unlimited. Kinda helps the memory.Not water and dust proof. Never a fan of getting my equipment wet regardless if it is OK too, but nice to have just in case.Expensive as hell! Coming in at the same price as the other big two, but is only with one carrier currently Verizon wireless. Hopefully that will change soon because this phone deserves a unlimited plan. Verizon does not offer, but it's easier to afford financing through a data plan. The pro to this when you purchase a US unlocked phone your avoiding all the BS bloatware from service providers.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1BQ7B10Q4QDDB?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-05-30", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "great phone,awesome features.best phone ive ever had.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1O82JH08G845I?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2018-03-21", "review_body": "Great phone!\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R34CAERCAKBLHB?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-06-01", "review_body": "I HATED this phone it wouldn't hold a charge and when it did charge it took more than a day!!! I got a refund to a gift card although I purchased it after the 32gb wouldn't come on!! I FEEL SCAMMED!! I am being forced to buy more Amazon stuff after getting burned twice I AM OVER IT AND WNT MY MONEY NOT A GIFTCARD!!!\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R2BCKRVBR46BPE?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-09-24", "review_body": "This phone get hot enough tp cook and egg on when ever you try to do anything with it.  Do not buy this!\n        ", "review_helpful_votes": 4, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R3GXASMCMY94M5?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-10-27", "review_body": "Google Pixel XL 4G LTE w/ 4Gb RAM, 32Gb device storage - Very Silver (direct from google)While I've demo-ed every Nexus phone that Google has fielded to date, none have ever held my interest.The Pixel XL is not just the latest iteration of \"Nexus\" smartphones. While falling far short of perfection, the Pixel XL still sets a very high bar of hardware design and tight software integration for the entire Android ecosystem to aspire to (if not fully exceed).This Google-branded foray into the high-end smartphone battlefield also falls short of being a full-blown iKiller, but it comes mighty close.First, mention must be made of where the Pixel XL fell short of perfection:- Non-user-removable internal batteryWhile the Pixel XL's on-paper specs for active use and standby charge life are very impressive, consumer electronics Lithium-ion batteries suffer irreversible internal damage and loss of calendar life once they are discharged below 50% of their original factory full-charge rating. This is why so many iDevices wind up requiring battery replacement service after ~100-300 full discharge/charge cycles. That's fact, not apocryphal (and true for the majority of consumer electronics Lithium-ion batteries).Consumer electronics Lithium-ion batteries really benefit from being kept topped-off as much as possible (which is one reason that there's a huge after-market for external battery packs and a cottage industry for replacing failed internal batteries). But, no matter how hard one tries, smartphone batteries just wind up becoming discharged below 50%, which then shortens the calendar life of that battery. Then you have to pay, one way or another, sooner, rather than later, for replacement.Another Lithium-ion battery problem is physical shocks delivered to the battery. It not just S*ms*ng G*l*xy N*t* 7s that melt, catch fire and/or explode. Drop/shock ANY Lithium-ion battery hard enough and you have created an electro-chemical time-bomb that can go into internal cascade thermal overload at some unknowable/unpredictable future date/time. No \"safety circuitry\" can stop it, once it starts. Hard physical shocks can induce short-circuiting inside a consumer electronics Lithium-ion battery. So, you should quickly recycle and replace a Lithium-ion battery that has been physically shocked.These are but two VERY COMPELLING REASONS for end-user replaceable internal smartphone batteries. Yet, Google decided against it.- No built-in wireless charging capabilityWhile this is not a must-have, think about how much money Google wants for the Pixel XL and look around and see how many similarly priced smartphones natively support wireless charging. This is a surprising and retro disappointment in the PXL.- No extSDcard slotWhile this is in keeping with Google's long standing refusal to allow for user-expandable device storage, 32Gb of internal device storage is a pittance in the face of storing 4K video and so-called VR content. My existing production smartphone has 32Gb internal storage, which is 48% full, and a user-added 64Gb 95Mb/sec microSDXC card, which is 70% full. (I do run a number of professional network and IT testing tools on that smartphone, many from the extSdCard.) All of this would NEVER fit in 32Gb. And don't forget how much device storage must be kept freely available for full Android OS upgrades/updates.I don't care for cloud storage of personal/sensitive data, period. Even though Google promises free, unlimited, original resolution image/video cloud storage for Pixel customers, that's going to mostly be useless to me. I don't trust Google with much of anything that I can't automatically TNO-encrypt, pre-cloud, and maintain as TNO-encrypted in-cloud. Also, think about the data plan costs of moving high-res images and 4K videos to-and-from the cloud. And how well do you think 4K video streams over LTE? Cloud is not for me. Please, give me an option to fully utilize a fast 256Gb microSDXC on-board expansion card.Google's hob-nailed boot steps down on my neck by continuing to refuse to support high-speed/high-capacity expansion storage. That is kind of EVIL at these high price points in the Android universe.My push back is to use a USB3.1/USB-C external memory card reader with the PXL for literally external SDcard backup storage. Sadly, I can't conveniently run apps from the card reader, but I can keep tons of data backed-up and freely available to me without the vagaries of \"streaming.\" (Just read the horror stories of people who lost way more than they bargained for by placing irreplaceable data in someone else's cloud storage. Yeah, that really does happen.)- The built-in speaker is mono onlyAgain, for the price, look at how many similarly (and even lesser) priced smartphones have built-in stereo speakers.- Only rated IP53 for dust and water splash resistanceSmartphone makers keep playing games with the resistance of their devices to environmental particulates and water damage. While I'm not demanding IP-68 rated full submersibility from Google, as long as smartphones continue to use cheap tin for solder joints and board traces, a phone as expensive as the Pixel XL can and should do better than IP-53. Please, Google, set a better standard for everyone else to match.None of these shortcomings are showstoppers, but they are all disappointing displays of Google's stubborn engineering arrogance/hubris..And now, the MANY THINGS TO REALLY LIKE ABOUT THE PIXEL XL, things that are definitely iSLAMMERS...+ Rapid battery charging, longer runtimes and standby chargeBattery run times and standby charge life will depend on exactly how you use your phone. That said, the paper specs on the Pixel XLs 3450mAH battery are: 32 hrs LTE talk, 14 hrs LTE data, 14 hrs WiFi, 130 hrs music play, 14 hrs video play and 522 hrs standby.I don't personally expect to see these numbers, myself, because of my app loadout and tendency to find myself in areas of marginal to poor LTE signal coverage (inside Faraday-cage-like structures and/or high ambient EM/RF interference); but these numbers are beefy, nonetheless. As long as Nougat (Android 7.1) doesn't serve up any nasty runaway built-in services/processes, the PXL battery should outlast a Nexus 6 doing the same things. My other smartphone, even with its significantly bigger battery, doesn't come close to the PXL's promise.Google claims the PXL can be charged (from O?) to 7 hrs of talk time in 15 minutes. I have to interpolate 7 hrs talk to mean less than 25% of full charge. If charging rates are linear (which they may not be), that would imply a full charge in something over an hour of continuous charging. While I've never fully discharged the Lithium-ion battery in my production smartphone, I know that fully recovering from a 50% discharge takes slightly less than an hour, and that battery, fully charged, is supposed to hold 4900 mAH, which is considerably more than the PXL's 3450 mAH. So, I'm not sure how rapid Google's rapid charging actually is in comparison. In a real world charging test, with WiFi on, LTE/BT/NFC/GPS off, but PXL otherwise in standby, charging from 79% to 100% took 27 minutes.Another thing to keep in mind is that there's more to the safe and sane \"rapid\" charging of Lithium-ion batteries than just the basic dance of balancing voltage, current and internal temperature. The chemistry and physical internal structure of the battery has to specifically support rapid charging, too. Google is keeping totally mum on exactly which Lithium ion chemistry they chose for the Pixel XL's battery. I can say that the phone does not warm up, at all, during charging, very much unlike my other smartphones.I left a fully charged Pixel XL, with an equivalent production loadout of apps, on standby (WiFi off, LTE off, BT/NFC off, GPS off, Airplane mode on) side-by-side with an older smartphone (that also happens to have a much higher mAH battery than the Pixel XL), for nine hours. At the end of this test, the Pixel XL had drained 1% of it's full charge. The other smartphone drained 63% of it's full charge. Part of the Pixel XL's standby performance could be battery chemistry, part of it is definitely the advanced power management of the Snapdragon 821 cpu.+ Bezel-ed 1440v2560 QuadHD AMOLED displayThe AMOLED display is outstanding even in broad daylight. 534 pixels per inch makes for very vivid/rich images. I don't have to shade the Pixel XL's screen to see what it's showing me in broad daylight. I'm also OK with the scratch resistant Gorilla Glass 4 (vs the more allegedly crack resistant Glass 5), because there's a functional bezel surrounding the screen's edges. (My PXL will live inside an Otter Box Defender case, too).I am adamantly pro-bezel for candybar style devices, as long as that bezel is both functional and durable. I'm not mounting the PXL up on a wall. I don't need any smartphone to be a functionally compromised \"work of art.\" My PXL is always going to be in hand or standing by on a custom carry retractable rig or dash mounted. The purpose of a bezel, in my world, is to protect the edges of the glass from damage and prevent unintended screen touches/button presses. Bezels that don't do both are useless to me. Edge-to-edge, bezel-less screen glass really means, to me, more surface area to attract damage and more unintended taps/presses. The bezel on the PXL is AOK by me.+ Android Nougat 7.1, Qualcomm Snapdragon 821+Adreno 530, 4GB RAMPixel XL ships with factory Android 7.1 and keep in mind that Nougat on PXL is a different beast from Nougat on Nexus, and just about anything else, for now.Un-rooted Nougat allows forcing apps to extSdCard so that you may test for yourself whether or not they will run (sans widgets) from extSdCard, by overriding the app's manifest. More power to the End User is a good thing.Surprisingly, there is no real file manager on the PXL's Nougat and Chrome is the only factory installed Internet browser. If you need to setup Microsoft Exchange Server ActiveSync accounts, do *not* disable the Gmail app. Nougat 7.1's Settings | Accounts only lets you setup Google accounts if the Gmail app is disabled. The reasoning behind these decisions by Google eludes me.The Snapdragon 821 is a quad-core CPU, with two full-power and two low-power cores for maximizing performance while also aggressively managing power consumption. The GPU is Adreno 530, 4K and VR capable. RAM is LPDDR4 and absolutely necessary for software to continuously leverage hardware performance. Bravo on all counts.+ Main CameraThe Pixel XL's main camera is a Sony IMX378 12-megapixel image sensor, with photon gulping 1.55micron pixels and a f/2.0 aperture lens. Google's proprietary (and compute intensive) HDR+ technology makes it the fastest image capturing HDR camera available on a smartphone today, across a range of lighting levels. The PXL can shoot 30 fps 4K video (3840x2160) and uses software video image stabilization, rather than optical image stabilization. That software actively reads the Pixel XL's internal gyro-sensor (@200Hz) to rapidly compute adjustments for shakes/jiggles. Fewer physically moving parts is AOK by me.This camera has no optical zoom, only digital zoom. Normally, I'm an optical zoom bigot, but the Pixel XL's 4K-capable alchemy has expanded my opinion of digital zoom. Plus, if I insisted on optical zoom, I can always clamp on an appropriate third-party helper lens.By default, HDR+ is always enabled and the camera essentially always captures frames in video mode. For still photography, 10 of 30 RAW frames captured are then sampled/composited together to produce a final JPEG image. This alchemy of hardware and software synergy develops significantly better images than from any other smartphone that I have used. The PXL takes the fastest and best non-flash, low-light photos of any smartphone that I have owned.There are downsides though. The main cam can only shoot 12.3MP in 4:3 mode. The best you can get in 16:9 is 8.3MP, because you are cropping away some IMX378 sensor data to simulate a widescreen image.In all of the main camera video modes (720p, 1080p and 4K) you do not have granular control over frame rate. Google Camera v4.2.022.135443920 (a Google Play update to factory Nougat 7.1) does allow you to select a pre-determined high frame rate (\"slow motion\") for video on the Pixel XL.Functioning as a GPS-enabled dashcam, the Pixel XL is so good at 1080P night vision that I wish it could project a heads-up display on the windshield. The levels of low-light illumination and contrast are quite remarkable, even with on-coming high beam lights. Everything remains in focus even when traversing pot holes and turns. The only limitation is that the 16x9 landscape video is not wide enough to catch all four corners when stopped at an intersection. An add-on lens will be required to widen the field of view.+ 3.5 mm stereo headset jack, USB-C charging/connectivity portHooray for the stereo headset jack! I deliberately don't use Bluetooth headsets of any kind and have ALWAYS used pro-grade wired headsets with cell phones from Day One, for brain EM/RF safety and conversation privacy.The even bigger deal, for me, is the USB-C charging and connectivity port. USB-C is the unifying data/power port of today and the future. It compliments and exceeds USB 3.1. Plug reversibility means there is no upside-down orientation. USB-C seriously future-proofs the Pixel XL across a wide array of companion devices that support USB-C, DisplayPort 1.3, HDMI 2.0 and/or USB 3.1 protocols. And there are adapter cables for legacy USB. The one thing to be aware of is that improperly terminated USB-C cables can inflict electrical component damage, so make sure you only obtain USB-C cables from reputable makers that properly implement the grounding specs.Because Android implements extSdCard as USB storage, I can use the PXL's USB-C port to connect a USB3.1 compliant, USB-C external memory card reader, which allows for memory card-based local data backup and rapid transfer of bulk data across devices.Google tells me that the PXL's USB-C port is a full implementation, so it is supposed to be able to push 4K video to an external monitor, using an appropriate adapter.+ Google AssistantI personally don't trust Google and I'm far from alone in that.I have always HATED the annoying invasiveness of GoogleNOW and it's all-or-nothing \"privacy\" configurability. Now, we get Google Assistant, which is supposed to be gNOW \"on steroids.\" (Similar/parallel concerns about privacy invasion and information hemorrhage make me equally despise Microsoft's cynical implementation of Cortana on Windows 10.)I don't want/need any corporation placing a digital diaper around my brain pan in a lop-sided trade for el corpo's definition of \"convenience.\" It's bad enough as it is with three-letter-agencies peering into spaces that ought to be private/personal with zero value-add for me.Fortunately, I can go into Nougat's Settings and defang the leaking-to-the-cloud \"features\" in the Google app (trading away OK Google functionality) and Disable or (even better) Uninstall Android Pay, Gmail (with the previously mentioned caveat), Google+, Hangouts, OK Google enrollment, carrier bloatware, etc without \"rooting.\"My privacy matters to me. My thought process is not for Google to reverse engineer. I do use highly effective applications, from non-affiliated vendors, for voice command, stand-alone/off-line navigation, traffic conditions, etc. I also use four different security hardened web browsers on each of my mobile devices. The Pixel XL will be no different (although finding reliable offline voice command is proving to be very tricky). Information about me that begins compartmented in the real world needs to stay that way, until I say otherwise, on a case-by-case basis. One time, blanket permissions are an insult to me. I also try not to put things into the cloud unless I can \"TNO\" encrypt, pre-cloud, and keep it that way in-cloud.The only way that Google Assistant can play a role in my world is if the bulk of the processing happens on-device, local to me, with highly granular permissions on and redactions of personally identifiable meta-data that I'm only then willing to share with Google or anyone else on a case-by-case basis. That and only that is Do-ing No Evil by Me. All of that is do-able, too, but Google just doesn't see fit to.+ 24x7 technical supportDuring my review of the Pixel XL, Google (not Verizon) pushed the ~33MB 05 Oct 2016 Security Update for Nougat 7.1 to my Pixel XL. (My high-end S... N... # is still waiting its 05 Oct Security Update for Marshmallow 6.0.1 from my ALWAYS-LATE-WITH-THE-PATCHES US other carrier.) Again, bravo, Google. Updates should be direct to device from Google for ALL Androids.24x7 TS is a must as there is no PDF User Guide available for the Pixel XL. And, yes, it's really 24x7.The on-line FAQs are quaint. I haven't tried Chat Support. I have called in and not gotten answers to some questions that I've posed (like battery chemistry). And, yes, Google's engineers are working on the Bluetooth pairs, then summarily disconnects software bug.+ Bottom LineI agree with others that the Pixel XL is very expensive, but, at this time, it's hard to find many of the PXL's features and functionality at any other price point. So, if you need what the PXL has to offer, then I do recommend it.\n        ", "review_helpful_votes": 100, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R195OT7SGJVW3B?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-06-29", "review_body": "After sacrificing my last Google Pixel XL 128 GB to the East River, I have replaced it with a new one.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R35DNKPR9V86MB?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-12-12", "review_body": "Great phone. Bought used, and it was in near new condition.\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/RTW10VZACVR5S?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-01-26", "review_body": "I live in the United States and this phone was shipped from the United States but it arrived with a wall plug that is suitable for Australia it has slanted prongs. Other than that it seems to work fine I did have to use another plug I had lying around to charge it I have requested Amazon to ship me the correct United States plug made by Google for the pixel phone and I'm waiting to hear their response\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/RQCC021BY0MY8?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-06-28", "review_body": "Phone broke after three weeks of using it I will never buy from this company again because it’s not trustworthy.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RTXYYYETAR5YE?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2018-07-11", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I was sent the wrong color and the device came with a bootleg charger which can kill the battery over time.This seller is apparently trusted but I will not be buying from the in the future since this phone does not work 100%.When I try to get to the home screen I get error messages and my phone will not let me update to the latest android update.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RIT3VK042HYAW?ASIN=B01M01ZZAC", "review_rating": 2}, {"review_date": "2018-06-25", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Solid phone with a solid design.  Easy to set up and use.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2EVMH8PAVJLL2?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-05-09", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "My wife loves it. The camera is amazing. I just don't like the Android OS compared to iOS. But my wife is quite pleased. The quality of design and speed of phone is incredible.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1LVEV5M8ULSKD?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-06-15", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Love the new phone.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R67XC7B5U3ORB?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-07-30", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Thank you!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R12UKCPHIBRQ47?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-06-30", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "This phone was in great condition. It works perfect.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R24XTA631HBONH?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-09-10", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Great experience, will buy from this seller again!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2MU0K354BBQS?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-12-24", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Hi, the device is now in demo mode after unexpected operation, so how to return to normal mode?\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RB123F0NVCSZG?ASIN=B01M01ZZAC", "review_rating": 5}], [{"review_date": "2018-01-07", "review_body": "Pure lies -- plain and simple.  The paint is chipped and every corner and side shows signs of excessive use.  The screen, although not cracked, has light scratches all over.As an amazon certified refurbished device, the phone should \"have no visible cosmetic imperfections when held 12 inches away.\"  In addition, it should be \"certified to work and LOOK LIKE NEW [emphasis added] by a qualified manufacturer.\"Please, take a look at these pictures and tell me if this phone looks \"like new\" and has \"no visible cosmetic imperfections.\"Thanks for wasting my time.\n        ", "review_helpful_votes": 30, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RLU0KC2ZOP0GN?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-05-23", "review_body": "UPDATE: FIRST: Do not understand why Amazon allows folks who have NEVER purchased a product to write reviews for that product? Of the 53 ONE star reviews the Pixel XL received, only 4, that's right, 4 were written by verified buyers. That's 1 verified buyer for every 13 reviews. In total, almost 1/3 of the ONE star reviews (not one from a verified buyer) were by folks who claimed to have paid at least $1,500, to as much as $2,000, for a Google Pixel XL that lists for $990. While another 1/3 of the ONE star reviews were by folks who clearly stated that they HAD NOT PURCHASED the Pixel/Pixel XL and WOULD NOT PURCHASE it because is was too expensive or they didn't like the provider's plan, mostly Verizon, which, in fact, has nothing to do with the cell. (Check their website, Verizon offers the same \"lousy\" plan whether you're buying a Pixel or a Samsung). Conversely, the Pixel/Pixel XL received about 50 FOUR AND FIVE star reviews of which 46 of the 50 or 92% are from verified buyers. That's almost comical.  Only 8% of the ONE star reviews are from verified buyers while 93 % of the FOUR AND FIVE star reviews are from people who made clean, verified purchases through Amazon. Now, who am I supposed to give the greatest weight to? If you adjust the ratings to scrub all the \" One Stars\" attributed to \"not worth the outrageous price\" and the like and spread them evenly across TWO through FIVE Star ratings, then this phone would rate in the 4.2 to 4.3 range instead of 3.6, a 20% difference between make-believe and reality. Yet another unfortunate demonstration that one must read the ONE and TWO star ratings very, very carefully to weed through those left by folks who simply do not know what they are talking about.  Sad, but all to often true. However, as a VERIFIED PURCHASER...After carefully reading all the new product reviews on sites such as CNET, Consumer Reports, The WSJ, and many more, I actually purchased a Pixel XL 128GB. No place, absolutely place I looked, had a list price for a new, 2017 Goggle Pixel XL 128GB Quite Black that exceeded $1,000. My Pixel XL 128GB Quite Black arrived about 10 days ago. I purchased an unlocked U.S. version from a merchant with a 97% 365 day Positive Rating fulfilled through Amazon with an Amazon A to z (doesn't work send it back within 30 days) warranty. I purchased an Universal SIM card from Sprint.  They overnIghted the card to me and the local store installed it and transferred all the data. Total cost to me for the Pixel, SIM card, shipping, and taxes were $997. I am in 7th heaven.The phone is easy to use, has a one to one interface that lets you sync directly with any Windows firmware or software via cable or cloud, 100% drag and drop interface, UNLIMITED FREE cloud storage between ANY model Pixel and Google Cloud. Over 800,000 free/low cost apps. Latest, full featured/experimental Android OS. And anything, anything, that was preloaded at the time of purchase can be used as is, used in the experimental developer mode or dragged into the trash and permanently removed.  Having started with pagers and PDA's back in the day, through four decades of bliss, beginning with Motorola's first sack-phones until I finally had to replace my beloved Blackberry, I have finally found a cellphone that I can pocket, use, and look to as a long-term asset.\n        ", "review_helpful_votes": 32, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3PK4YHKAFPWQC?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-06-19", "review_body": "The phone works great.  Everything is smooth and fast.  One of the best features is the battery.  It lasts two full days with normal usage without charging.On the down side, I miss the IR blaster I had and used as universal remote on my previous phone.Also, I am a bit worried about not being able to remove the battery.  Didn't run into an actual problem about that, but I am worried.All in all, a great phone.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R2BUD6UECCF60U?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-05-24", "review_body": "Out of the box, I would’ve given it 5 stars. Now, while purchased at the end of February, it is useless and cannot be fixed by a local repair shop for under $240. I LOVED this phone and it was my first android phone after nearly a decade with Apple. Don’t know what to do now.\n        ", "review_helpful_votes": 5, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R3A61JYWWRI6ZC?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-09-08", "review_body": "Very but very excellent\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1QSWMFLJGCJMK?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-06-15", "review_body": "F\n        ", "review_helpful_votes": 1, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1AYGZX4MFCWHO?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-02-17", "review_body": "Perfect cell phone that I didn't have it before from google wich they manufactured it hardware and software and I always like google cell phones and the google company finely they produced a perfect cell phone that I wish it from long time that they make it by google the body and software both pure android. Thanks Amazon thanks Google.  It's really a premium platinum cell phone.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R20DMJLC4F4JQL?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-11-06", "review_body": "Camera is a beast. Replaced my Note 7 with this. Its missing some features that the Note 7 had, but its superior in other ways: Less laggy, even better camera, much better battery life, better voice assistant, much better fingerprint scanner, much better stock launcher, probably better VR headset, unlimited free cloud storage of full quality photos and videos ....and i actually kind of like the bezels because i dont find myself accidentally touching the screen with my palm like i did with the Note 7. And of course, its less likely to burn down my home.Water proofing and wireless charging would be nice, but man, this camera seriously delivers some sharp, cool looking photos, and the battery life is exceptional. On paper its a somewhat plain phone compared to Samsungs offerings, but I actually prefer it because it delivers so well on the things that matter most.Its as refined and smooth as an iphone, with all the superior customization and functionality of android. Best of both worlds......with the best camera.Note: I was an iOS user since the first iphone until i got a Note 7. Making the switch takes time if youre as deep into the ios ecosystem as I was, but Android for sure is the better OS, and i regret not switching sooner.\n        ", "review_helpful_votes": 64, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R6WOVC8GBM80G?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2016-11-10", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 38, "review_title": "\n        ", "review_body": "I was lucky enough to get a pre-order of the Pixel XL phone in as soon as it was announced by Google.  In a nutshell, it is the best Android phone on the market today (Nov 2016).  I have owned a Pixel XL, a Nexus 6P, and an iPhone 6S+, and I would rate them in that order (Pixel first, iPhone last).  The hardware across all three seem comparable.  The Pixel XL is noticeably lighter than the Nexus 6P, and it’s a little faster.  But all three are pretty close in terms of performance.  The big differentiator is the software.  The Pixel XL comes with the latest version of Android N, with Google Assistant fully integrated.  Nexus is also great and you can install the Google Assistant.  The iPhone 6S+ is a distant third - iOS has gotten harder to use over the years and Siri just plain sucks.  The Google Assistant has become my goto action on the phone, and it’s 100x better than Siri.Even though companies like Samsung also make good hardware, they just have to load up their phones with a ton of bloatware which is nearly impossible to get rid of.  The very nice thing about “made by Google” phones is that it comes with the default stock Android operating system without all the additional bloatware that other phone makers add to theirs.  Google also keeps it phones always up to date with the latest version of Android, whereas with other phone makers they often choose not to upgrade because it’s a lot of effort for them.So, the Pixel XL is the latest of the “made by Google” phones, and it is by far the best Android smartphone out there.  Amazon doesn’t carry the Pixel phone - in fact Amazon won’t carry a lot of the “made by Google” products because Amazon considers Google a competitor (Google’s Home product competes with Amazon’s Echo, the Nexus tablet competes with the Kindle, etc.).  So as of Nov 2016 you won’t find this phone on Amazon, with the exception that some smaller less-than-reputable companies pre-ordered a number of phones from Google and are now selling through Amazon with an exorbitant markup (~2x the retail price due to the high demand and short supply of these phones).  I purchased my Pixel XL on the google store (store.google.com) at retail for $750+tax USD, that’s probably where you should go if you’re looking to buy one of these.  Many of the reviews for the Pixel XL on Amazon are negative mainly in response to the price-gouging by the smaller resellers, you can ignore those because those reviews have nothing to do with the phone itself (they’re more directed at the companies trying to take consumers for a ride).So what do I like about the Pixel?- It’s fast and responsive, much like the Nexus 6P and iPhone 6S+.- Like the Nexus 6P, the fingerprint scanner is really fast and responsive, and placed in a MUCH better spot than the iPhone 6S+.  It’s where the index finger naturally sits.- I really like the latest Android N software, and I really really like the integrated Google Assistant.- The external reviews made a big deal about the camera - after using it some I have to say it's quite good, even better than the iPhone 6S+ which I thought was already great for a phone camera.  The phone is *much* faster than the Nexus 6P phone (meaning it takes the photo when you tap, not 1 second later), and takes excellent pictures in low light.- The camera app has gotten a lot better - the video recording now has a pause feature, and you can take 4K video!- Battery life is excellent, but again not much difference from the other two (which were also very good).- Like the Nexus 6P, this phone uses a USB-C charger, which means it charges very quickly.  I don't have to charge overnight any more, plugging in once in a while keeps the battery mostly full all the time.- Google keeps its phones always up to date with the latest updates, much like Apple does with its iPhone.What don't I like about the Pixel XL?- The Nexus 6P had stereo speakers (one speaker on the bottom and one on top), whereas the Pixel has speakers only at the bottom.  It's not bad, but you don’t get the same stereo effect as you did on the Nexus 6P.- Like the Nexus 6P, the volume buttons are pretty far down on the side, which makes it hard to use some hands-free car cradles that want to squeeze both sides of the phone without errantly changing your volume for you.- Like both the Nexus 6P and iPhone 6S+, sometimes when you take photos while capturing video you get a slight glitch in the video where you snapped the photo.  C’mon Google, you should be able to fix that!- It doesn't have a micro-SD slot, you're stuck w. the storage the phone comes with.My overall recommendation is to buy this phone, it is the best out there.  Right now you can get it through Verizon, or if you want to purchase the unlocked version you have to buy it from the google store.  However, it’s expensive (similar cost to an iPhone).  If you want a very similar made by Google phone at about half the price (since it’s a year older), I would also strongly recommend the Nexus 6P.  It’s very similar to the Pixel XL, just a little heavier but it will get the latest Android N and the Google Assistant.Happy shopping!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3JCLAA23I3MC6?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-11-07", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 9, "review_title": "\n        ", "review_body": "I bought the pixel XL at Verizon based on all the reviews and hype on the internet. At first I liked the phone, but the more I used it the more frustrated I became. I spend a lot of time on conference calls so the phone functionality is very important. The phone functionality is so 'sub-par' compared to Samsung or Blackberry (yes Blackberry), if I was Google I would be embarrassed.  Basics like muting and unmuting calls and still having access to the keypad -- not possible. The bluetooth is frustrating how it connects to one device and not another and doesn't default to the wired headset when plugged in.  How is prioritizes or selects connections is frustrating (to say the least)!  Basic functionality of the phone is not up to the level of what a Samsung was years ago. Seriously this device is a disappointment, especially given the hype and the price!The camera does take great pictures. I like the size of the XL and it is a durable device. Battery life was good in the beginning but I can tell it is deteriorating only after a few months.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1CVUBILFKROHN?ASIN=B01M01ZZAC", "review_rating": 2}, {"review_date": "2017-01-29", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "The phone that I want!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R36KJKH18PTOH1?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-01-26", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "amazing phone\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RGNEARBA9QTCV?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2017-07-01", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 6, "review_title": "\n        ", "review_body": "Does anyone else have a problem with the keyboard disappearing after usage for over 20 minutes? Well my phone is less than 1 week old and hasn't seen a scratch. Will update review after responses thank you for your time.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R34SR5C3LD6831?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2017-11-28", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 9, "review_title": "\n        ", "review_body": "I wanted to love this phone. I really did.  I went from a Galaxy S5, and needed to upgrade after a few years with it, and chose the Pixel XL.  Horrible phone!  Constant glitches, messaging and phone calls stop working randomly; super inconsistent reliability that has NOTHING to do with service or network; pure phone.  Finally, after hours with support, and 'safe mode' and 'factory resets,' (what a pain!) they told me to send the phone away (thank goodness I had my old phone to use while it was gone!) and wait for a refurbished one.  Well, got the refurbished one, and this one is the same way.  For example, I'll google a restaurant I want to call, and hit \"call,\" and it freezes, blacks out the screen,  then won't allow me to open the phone app at all. Like, literally can't make a phone call for an hour or so until it randomly decides to work again.  Ummm, isn't that a BASIC function for a phone? To make phone calls?  HIGHLY DISAPPOINTED.  Camera is amazing, but the fact it can't consistently work is deplorable.  Stay clear of this phone; it's really awful even for the most basic needs.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RX8K7AAQGWMPX?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2016-11-15", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 53, "review_title": "\n        ", "review_body": "This is an evaluation of the Verizon offered phones, comparing Pixel XL against Samsung S6 &amp; Note 7 (Used only briefly)PROS of Pixel XL* Overall the radios in this phone function better than the Samsung* Superior cell reception, works in border-line Verizon areas where my Samsung S6 &amp; Note 7 would drop calls while driving (Northern State Parkway at Round Swamp road for instance)* Superior bluetooth sound quality, when paired with a Plantronics Voyager Legend or my car, than the Samsungs (On the Samsungs 1/3 of the time the person on the other side could not hear me good enough, and I had to change to the handset)* When watching video's (embedded in news, youtube, etc.) the performance is far superior over the Samsung S6 and Note 7. I would say 90% of the time I can successfully watch the video on the Pixel XL, where it was less than 20% on the Samsungs. Same Verizon network, same locations in Huntington and Plainview NY.* Battery Life blows away the Samsung S6, somewhat better than Note 7* USB C charger cord (inserts both ways) makes it easy to plug in power in dark places (Dont need to know which end is up)* Far better speaker than the Galaxy S6 or Note 7. No matter what angle you place the phone in front of you, the speaker is loud and clear* New OS, I like the built in silence mode that you can choose how long the phone needs to be quite for, and then it automatically will go back to normalCONS of Pixel XL* Samsung's UI is better overall, but I got use to the changes except I miss that the Samsung Notification UI that is far far better. It is less cluttered, easier to understand how many messages, voice mails, etc. are pending for me. This is important to me because I have a mix of whats app, sms, emails, and voice mails. I am struggling with this on my PixelXL* Note 7 introduced a terrific capability to juggle multiple bluetooth sources so that my bluetooth earpiece and bluetooth car stereo/phone played together well / were easy to select between on the Note 7 - gosh I miss this.* Not Waterproof - I suspect I enjoy better speaker performance because this isn't waterproof.* No Wireless charging* Finger print scanner is under phone, which means you have to pick it up to unlock it.* The encryption felt more secure on the Samsung. I get to choose the encryption key, there is an entirely different password that must be entered whenever the device is booted, 10 bad attempts erases the phone.  Verizon claims the Google Pixel is just as good, just different. I don't know, I am having a hard time believing this.* IT bears repeating ... the Notifications aspects of the Pixel XL is very poor. It is not clear that you missed a call or have unread voice mail waiting.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RFCBTP5LDEYVB?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2018-06-06", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "I have this phone and have had 2 replacements. Both had rebooting issues. The exchange is fast but proving the phone has issues is a pain. You MUST go through their process for testing.Does it reboot when plugged in: CheckDoes it reboot regularly or random: randomly all the time.Put it in safe mode and run it. (note: no apps work when you do this): yes and its painful depending on time between rebootsPut it in debug mode and send logs: yupResponse, yes it need replaced. (first time the phone bricked and did not come back after a reboot so I waited 4 days for a replacement)2nd time another 4 days but transition was easier because I could copy data over.Pain in the butt! Until the 8.1.0 update this was not an issue, since then its been consistent. I do NOT recommend a Pixel XL.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R25D36DT8S2LFE?ASIN=B01M01ZZAC", "review_rating": 2}], [{"review_date": "2017-10-18", "review_body": "This is the worst phone I have ever had!!  (and the most expensive) Mine is brand new so cost more than this one factory unlocked.The assistant, which is why I bought it, does not work dependably at all.  She does what she wants to when she wants to, or does nothing at all.  I cannot unlock it with my voice, so IT IS NOT HANDS FREE AT ALL!!  And that is why I bought it.  I was told I could unlock it with my voice if I had no free hands, and it works for an hour or so and then I have to manually put in the code again to unlock it.  I have been back to Verizon several times, and they tell me they have fixed the problem, and it will work for a couple hours and then I have to  manually put in the code again.  I am used to the Amazon Echo, which I LOVE, but this Google assistant is a pain in the neck and almost totally unresponsive.Nothing is easy to find and nothing is easy to do.  Every small task involves constant searching and attempts to complete.  I hate the interface!! It makes my life a misery, and I love tech, so it is not me.  the problems are too  numerous to even list.  I have had it several months now, and cannot return it, because I wasted the time having the Verizon people try and solve the many problems, which did NOT STAY FIXED for very long each time.  Turning the darned thing on is a major problem from the sleep mode.  IT IS SO OVERPRICED it is absurd!!!  And I am stuck with the darned thing.  BE WARNED.  it is very expensive garbage.  I still have my old Samsung 4 which I kept for emergencies and thank goodness I did because i need to use it frequently when I cannot manage to use the Pixel XL.\n        ", "review_helpful_votes": 8, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R303LNGY1XK1Z0?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-05-09", "review_body": "This may be the worst premium phone ever made.  On the first hot Summer day in Chicago, the phone overheated and shut down three separate times.  I contacted Google support and they claimed there wasn't anything wrong with my phone and e-mailed a list of what they consider legitimate (meaning the warranty doesn't apply) reasons why this might happen on the Pixel XL.  I've had 100.00 phones and 300.00 phones and 500.00 phones and a 600.00 phone but before the Pixel XL, I never owned a phone that repeatedly shut down because I used the GPS on a hot day.The phone reception is pretty lousy compared with other phones that I've owned.  The speakers sound tinny.  The battery life is disappointing.  The battery runs hot (90-100F) when the phone is idle and sitting in an air-conditioned room.  Pixel support is useless.  The Pixel XL is at best a 300.00 phone marked up obscenely with a build quality that is obviously lousy compared to genuine premium phones.If you buy one of these things you will probably regret it.  This is the response I got when I complained about the phone overheating and shutting down:Hi Joe,Thanks for contacting Google Support!This email is in regards to the chat conversation we are having right now, as discussed, once you roll back to Nougat update, please follow the recommendations below if the issue persists.Your device may warm up with use. Letting the device ‘take a break’ from use or limiting/turning off features (even those running in the background) could remedy the situation. Here are some tips/suggestions:Media apps (music, video games)1) Close or turn off other apps and features that you're not using; they may be running in the background.2) Discontinue using the media temporarily until the temperature normalizes.User-installed apps1) Put the device in safe-mode to disable 3rd party apps and see if the issue improves.2) Try uninstalling recently installed apps to pinpoint the app causing the issue.Display brightness1) Manually setting the brightness to be very bright may contribute to higher device temperature.2) Consider setting to auto brightness to manually reducing the brightness setting.GPS / 3G / WiFi - prolonged data connectivity1) Turn off feature when not in use.2) Stop or limit use and allow device to cool down if it gets warm.Exposure to direct heat1) Remove from heat and keep away from direct heat or excessive sunlight.Poor ventilation1) Expose the device rather than keeping it tucked away in poor ventilated/tight areas (layers, small pockets, bags).Cases1) Don't use a case that covers the front and back of the device.2) Use official case (available on Google Store in some countries).Chargers1) Don't use unofficial chargers which can overcharge and degrade the battery.2) Use official charger (available on Google Store in some countries).Daydream View1) Daydream View requires high performance from the device. The device's temperature should stay within safe limits.2) Remove any protective cases from the device to improve thermal ventilation.3) If your device feels too hot, stop using Daydream View and allow the device to cool down.Android Wear1) Power off the device for 5-10 minutes and turn it on again.2) Try using the watch for another day to see if your issue improves. If your watch is still warm after a day, reply to this email and let us know.Thanks,MadasuThe Google Support Team - Supervisor\n        ", "review_helpful_votes": 16, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RK4EC5MX8OASN?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2019-01-14", "review_body": "I paid over $900 for mine new, with 50% down, I just paid it off and they're already on their 3rd phone. it was AMAZING when i got it. but as soon as the new pixels came out, this on got worse. it got slower, the music app playlists do not work. it will shut itself off with 30% battery. I understand its marketing and these phone makers just want people to buy the next phone over and over again and always be paying for these things that can last forever but they tune them to last until the next best thing comes out and its a never ending cycle we are all trapped in. I was hoping google would be different and make a phone that lasts. Stop slowing us down. still better than any apple product.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R31AHJDMF65OCQ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-01-09", "review_body": "Great phone, great service. Very happy. No issues.\n        ", "review_helpful_votes": 6, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3SJ38T1KO7UKC?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-11-12", "review_body": "I purchased my 128 GB Pixel XL through my wireless carrier to replace my ill-fated Note 7. I am unhappy with the build quality of the phone and Google's suppurt.Cons:Build quality. My first two Pixels had failed light sensors. Instead of blanking the screen when I held the phone to my ear, the screen would go blank when a call came in or when I dialed out. Even multiple factory resets would not fix the issue.The phone overheats and struggles to remember Bluetooth devices.Support. The idea of instant chat straight from the Help tab sounds great. In practice it is very tedious. Set aside an hour if you use it.Incompatibility with Smart TVs. You cannot mirror your screen like you can with Apple and Samsung products. You must use a Chromecast dongle or buy a Chromecast-enabled TV. Even third party spps just cast your local content, not anything you put on screen.ProsGreat camera, speedy response time, good integration with Google services, sound quality is good.\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R3COO8P7BW5YHG?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-11-02", "review_body": "beautiful and very fast. My only complaint is that it is not B4 which is the most in Latin America....I can only use it on 3G\n        ", "review_helpful_votes": 7, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 4, "review_source": "https://www.amazon.com/gp/customer-reviews/R10W36MVJ1Q022?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-11-24", "review_body": "I got this phone used from a family member. I have Family Mobile service, from Walmart. It runs on T-Mobile towers. This phone was previously on Verizon network. I didn't have to do anything but put in my sim card and it worked. I am so pleased with this phone. I had the J7 Pop, purchased from Walmart and this phone runs circles around it in all aspects. It upgraded to Android 9 (Pie) as soon as I put my sim card in. I LOVE THIS PHKNE!\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3US71DBSSHQVR?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-05-10", "review_body": "Excellent phone, hands down the best Android phone I've ever owned...the camera is the best in the market...it blows away the iPhone 7 and it's responsiveness it's truly one of a kind...Google did something right here.  Unlimited storage on Google photos is perfect!  Highly recommend to give it a try...don't be misguided by the negative reviews on here.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R1BUJZGJQOP3MZ?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2017-11-15", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 1, "review_title": "\n        ", "review_body": "After the Android 8.0 update - this phone acts very strange when on calls - screen flashes, will not go back to call screen without an act of congress - makes what would be a 5 into a 2. What keeps it from getting a 1 star is the cool photo options and excellent battery life. I am frustrated enough with this phone that I want it either replaced or a full refund because I use it for business = on the phone quite a bit.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RJSDB7YBPKDUE?ASIN=B01M01ZZAC", "review_rating": 2}, {"review_date": "2018-08-24", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Coming from a Huawei Mate 9 Pro to this, I really miss my Mate 9. It was smoother &amp; faster overall, a more refined experience, than this Pixel.The two biggest issues with the Pixel are the lowsy battery life, the slow charging time (even when it says Charging Rapidly), and the GPS is unreliable &amp; frequently goes off in both urban &amp; rural areas. Not impressed with this phone.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RU3SGXGBIR1E0?ASIN=B01M01ZZAC", "review_rating": 3}, {"review_date": "2017-10-16", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 2, "review_title": "\n        ", "review_body": "that said it all.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R18B6SIMN4BK49?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-01-01", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 2, "review_title": "\n        ", "review_body": "the phone suddenly died, it was working perfectly no warnings nothing. it was 3 month passed warranty which is 1 year. they refused to replace it. took it to the authorized repair shop they sais all components are fine but the main board is dead. nothing they can do to fix it.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3P65W3U1X4DIL?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-05-31", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I've had two Pixel XL's and I just don't think the phone even comes close to living up to hype.-Screen glass scuffs easily-Battery is barely ok-Crashes more frequently than my Note5 ever did-Huge bezel, what were they thinking?-Everything else (camera, gps etc) is pretty good I guess.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R1UT32U5O9P25I?ASIN=B01M01ZZAC", "review_rating": 3}, {"review_date": "2018-08-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "I bought this phone because it's supposed to be free of extra bull**** but that's changed and the screen it's self is very inaccurate the battery life sucks the screen isn't bright can never hear anything on speakerphone is all kinds of crazy processes that go on by themselves I don't even have any apps installed and that's just the tip of the iceberg\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RKZA7DAXSJIJU?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-11-06", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "This phone is used but you have to dig to find that out. Beware of Kanga!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RCX04IHTY9UX0?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2018-10-16", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Did not receive a new device! Not happy about being deceived!!! Buyer beware!\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R211PEDZ1Z0W02?ASIN=B01M01ZZAC", "review_rating": 1}], [{"review_date": "2018-04-18", "review_body": "Nothing particularly unique about this android phone.  It is expensive, and not reliable.  My Pixel started to act up after one year (flashlight would turn on randomly, screen would revert to color blind mood, speaker would not work.  Google customer service said it was due to some applications that I downloaded.  I got rid of all applications, and attempted to use the phone in Safe Mode, and it still did not work.  The recommended Google repair service immediately knew of the problem...a faulty motherboard.  This is relatively common, as I understand.  It was $400 to repair, for a 16 month old phone that cost $650.  Google would not offer any credits or accommodations.  I had to pay of the faulty Pixel, and replace it with a much less expensive (and, frankly, nearly identical Mota E4.  I am very pleased with the Motorola.)  Google blew it.  The Pixel is a bad product.  Buyer beware.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R110SL0PN72PL1?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-10-31", "review_body": "So I bought the pixel XL at Verizon and at first I loved this phone but then it started... The bluetooth is crappy. The phone drops calls with lte signal... I live in the same city as my mother... She has Verizon and a Samsung phone and she can walk through the house with no issue WTH Google!\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RKW9H0CYK2T05?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-01-15", "review_body": "Good quality product and fast delivery.\n        ", "review_helpful_votes": 7, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R30GODVGURZEEM?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-09-19", "review_body": "BEWARE NO 1 YEAR MANUFACTURERS WARRANTY if you buy from BUYSPRY!  Only  90 day warranty.  Not 1 year manufacturers warranty if you buy from BUYSPRY.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R1I1O5P1O1T056?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-06-19", "review_body": "As far as surfing the internet and its overall speed this phone is ok when it works. I like the battery life and speed to charge. When working the video quality is good as is sound quality of the speakers. The problems with the phone have to do with it actually being used as a phone or internet. When I first received it I immediately had issues with it muting out on calls. This problem persists months later much as google had promised over and over they had fixed it. Recently the microphone began to have issues which was is a now documented issue with Google. Google claims that a limited number of phones have seen this hardware defect but a friend at work has the same phone and the same issue so I'm unsure how isolated it really is. Do not believe the hype on the camera the zoom is terrible and the quality of the pictures is like my phone 10 years ago. You can not go easily between video and pictures so you can not snap pictures while doing video like every other phone. There are no text or call notification on the main screen so if you don't her the initial notification you must go into each app to see if you have a missed call or missed text. I really wanted to love this phone but at this point I'd much rather go back to my old, slow phone made by a different manufacturer than deal with this device. Paying this much money for a phone and having it malfunction like this only 8 months after buying it is ridiculous.\n        ", "review_helpful_votes": 5, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R2TISVX252IJNK?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-10-25", "review_body": "I got the Very Blue 32gig XL and it's a wonderful phone with options not availible to any other phone. Google assistant tells me the weather and reads the news every morning just by me telling the phone \"Good Morning\". The live wallpapers are great. I like the horizon one that the sunrise and set is based on the battery. The fingerprint sensor is almost instant. And!; I can take all the pictures I want and store them for free!!\n        ", "review_helpful_votes": 22, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R29SNL1QR4KWC0?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-11-24", "review_body": "Phone is great..but why would anyone buy from this seller.buy right from Google or your phone carrier\n        ", "review_helpful_votes": 19, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/ROI0SAYK8K9Z6?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2018-02-14", "review_body": "The ad states this a G-2PW2100 phone IE the US version of the phone.  I received in the mail the G-2PW2200, the international versionWaste of time and money.\n        ", "review_helpful_votes": 0, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R23BT51E1UOH1L?ASIN=B01M01ZZAC", "price": 316.97}], [{"review_date": "2017-05-18", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Terrible phone. Worse phone I have bought in a while. Display is small.  Phone is extremely quiet. Seriously no matter what, the volume does not go up very loud. Anything, ringtones, speakers, music, ear piece. Phone freezes. 90 percent of the time my Google search bar doesn't work. Know how annoying that is driving in traffic and you have to constantly change to browser. I have an iPhone work phone. I have never ever like iPhones or \"i\" anything and I prefer my work phone because I can actually hear people talk. Screen works better as well on iphone. Keyboard... WAY better on iPhone 7 plus. This is the seriously the first iPhone I've ever owned and I hate it. But not as much as the POS I bought for 750 aka pixel XL.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2BW4UNRDC3SND?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2017-06-01", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "Very poorly engineered phone, you'd think for a 650 $ phone it'll be at least somewhat water resistant.I splashed some water and the phone was gone...like completely fried. Plus you put it in the day dream for 1/2 and hour and you'll get a migraine from all the heat.Their official service center is just as bad too. UBreakIFix said they'll take it in for 2 days for diagnostics. kept it for 9 days and then returned back saying they can't do anything.Plus You get locked in the Fi plan and you're done for. Pretty soon you'll be paying 160$ for internet bill cz you'll have used 16 gb of data (T-mobile could give you unlimited plans for 50 bucks)Your phone breaks and you can't put your sim in another phone cz FI !!!I sorely regrey\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R15IKUBDWO3VOV?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2017-10-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 3, "review_title": "\n        ", "review_body": "Expensive piece of S*&amp;t.  Phone and camera are decent, but with a battery that can't keep a charge, what's the point?  Since the phone was only 6 months old, been having battery issues and won't maintain a charge anywhere near as long as advertised--realistically 1/3 of what was promised.  I find myself charging the phone at least 2x a day.  At least the charge is relatively fast.  I contacted google (project fi) directly about this issue and they said they could only send a refurbished phone, likely with similar battery issues.  The worst part is that they want to charge a hold on my credit card for the value of a new Pixel 2 ($749) phone while they are only sending me a REFURBISHED Pixel 1 phone.  Incidentally, a new Pixel 1 phone is only $649 on their website!!!  Given my investment in this piece of junk and project fi, I haven't decided if I will stay or just switch to the new  iphone when this phone completely dies, I hear the new iphones have great batteries, and that apple has pretty good customer service and stands by their devices.  If Google wants to charge iphone prices, then they should stand by their phones and offer comparable service. Just my 2 cents.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/RWXFMZYYGUEK7?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2016-12-03", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 7, "review_title": "\n        ", "review_body": "First Phone Manufactured By Google and built by ECC With Mostly metal body and Glass at the back.Nice Build Quality , Fellls Good In hand , Excellent Camera , Good Hd screen with great viewing angles ,Latest Andrios Os ,Really Fast (Even faster than Iphone in some cases ) , 4 GB oF RAM , Google's assistant is also quiet good , Good Battery Life ,the only thing that is just Okay is its speakers , Overall a Must Buy Phone and specially for a gamer or a Camera Lovers.Go Fot it :) Cheers :)  Love it\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R29YHLO372CCB2?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2016-10-20", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 155, "review_title": "\n        ", "review_body": "Just bought my google pixel xl 128 gig from google for 923.00 after taxes...... I'm  not sure why you are hiking the price close to double what my unlocked phone costs from the manufacturer, but if someone buys it from you at that crazy  price - Godbless you.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R17YLQ27PL140U?ASIN=B01M01ZZAC", "review_rating": 1}, {"review_date": "2017-01-12", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 0, "review_title": "\n        ", "review_body": "The best Phone from Google anel until now\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R3B2R7LFE6VZKW?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2016-10-24", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 44, "review_title": "\n        ", "review_body": "It is the best phone I have owned. People are complaining about the price but the Iphone and Samsung devices are priced the same? and I must say It has a better everything so I can't really complain about the price. The design is great, although I would like to see a smaller chin on the front. The google assistant is great as well, it is still a work in progress but it does pretty well overall. The camera is amazing and on par with the s7 and Iphone 7. It is blazing fast, the fastest phone I have handled. If you are going to spend the money on an Iphone (which I have owned every s model and have got to test the 7) The S7 which I have only handle in stores or this phone I PERSONALLY would recommend the Pixel. They are all great phones however it boils down to preference and I am definitely not disappointed with my purchase.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2JOLPFGMS3ZW0?ASIN=B01M01ZZAC", "review_rating": 5}, {"review_date": "2016-11-28", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_helpful_votes": 17, "review_title": "\n        ", "review_body": "Bought from Google but returned it and here's why:1) Email: I use an exchange account and an office 365 account, and couldn't get both to sync with the native calendar and contacts, without installing three different programs. Other than phone calls, emails and calendaring are the most important functions to me and I needed it to be more seamless than what the Pixel allowed. Other Android phones (Sony, Samsung) offer an email app that has already worked out of the box.2) Every now and then, the ringer would just stop.  I'd have to reboot to get it to kick in again.3) The kicker for me was when I used Google maps in the car and only got every other word of the command because the phone was crapping in and out.  It seemed to me that Google maps should work well on a Google phone. But no.4) Really poor battery life.5) Phone call quality was subpar, and in some cases, there was a noticeable buzzing noise - almost like interference - during calls. This happened regularly.I wanted to love this phone and in fact thought the finger print reader on the back was great - one of the fastest I've used.  Photos were also very good, although not so much better than other phones to make up for all of the Pixel's quirks.  I suspect things will get better over time; and for people completely wed to the Google universe, who don't need exchange, etc., this may be a good choice for you. But I was spending too much time trying to get basic things to work.\n        ", "price": 316.97, "review_source": "https://www.amazon.com/gp/customer-reviews/R2ICK0WN2U1OFY?ASIN=B01M01ZZAC", "review_rating": 3}], [{"review_date": "2016-12-18", "review_body": "Good device is you don't mind WORST INTERFACE EVER!This Google's creation is literally a schizophrenic monster born of a fevered dreams of re-design EVERYTHING conventional (see: established as a reasonable working smart phone behavior and UI) - It's literally a monocycle with a square wheel –Regular smart phone design and the part of back-end technology that suppose to do back-end things works fine ...BUT– that's where the good part ENDS.For all those who ever owned a nice working droid - designed in say.. Motorola standards this is like looking at a phone designed by someone who only once heard a smart phone described to them (possibly in a foreign language) and are not really clear on the idea of WHY would you need it in the first place.Seriously -  it's a usability NIGHTMARE!1. The regular updates (that you are not aware of) are constantly re-arranging menus.Yesterday my key-board was hiding the paragraph return button behind the Add Emoji option (obvious choice to begin with when you are looking for a 'return' option). Today it's been moved and now hiding as an option for capitalizing a letter. Totally intuitive options in both cases from obviously extensive usability testing trials.2. Fie Sharing -Plugging your Pixel into computer will not let you see files (like normal Androids use to). Now you have to download Android transfer - which .... DOES NOTHING. It Will tell you that you may be not able to connect to anything because your screen is locked - which it isn't. The complete lack of any preferences or options with suggestions on HOW to fix it, adds extra delight to figuring this out.3. Camera -great quality ... nice options to adjust the picture - all in (surprisingly) in one place ... except the Save function. Which is on top pf the screen - elegantly blending with the photo - while all the menus are still highly visible as menus - on the bottom.4. Photo storage -Yes it's broken down into albums but you will need some time to figure out the logic behind how those are structures or how much glue the UI designers had to sniff before coming up with the final logic. Still - if you find what you are looking for it may not be there a few days later when the updates been sent out.5. Sending a text ...A special adventure if you are using it from your addresses. Because while you can find the recipient - it's completely UNclear as to HOW or Where to enter the text. There is actually a number of arrows you need to try before you are allowed to see the text field. Should you need to do this in a hurry - you are out of luck.Adding another person to the text message can only be done Before you start typing it. Sharing a message may be an option but first you will need to figure out HOW to find a person you are sharing it with - the choice of persons given can be random and it is not clear HOW to find the one you need. It may be hidden behind a map icon or just not available at all.Those are just Immediate pleasure I have encountered in the first few weeks of owning this wonder. And I LOVE Androids. I couldn't wait to switch from the iPhone.\n        ", "review_helpful_votes": 16, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 2, "review_source": "https://www.amazon.com/gp/customer-reviews/R2D0PTT7R2Q5XP?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-04-05", "review_body": "Overpriced piece of junk.  Battery life is awful, interface clunky.  iPhone 7 Plus 256GB is available for less from Apple or any U.S. carrier.\n        ", "review_helpful_votes": 3, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R2IT3YM1OO7S4U?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-10-26", "review_body": "Very solid phone. Coming from a Nexus 6, the XL fits a bit more comfortably in my small hands. Runs very smoothly and Assistant is a huge selling point. Love my Pixel!\n        ", "review_helpful_votes": 8, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R236S2EDHIV9HB?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-10-27", "review_body": "Amazing phone, after I used the kids college fund to purchase this fine piece of electronics, and as soon as I switched the sim card from my flip phone, this phone got to work wasting no time whatsoever.  It cooked us a delicious leg of lamb,  then vacuumed the carpet, and in the evening it read a story to the kids before putting them to bed. I am very happy with my new phone, true it is not cheap but compared to the cost of hiring a butler,  it is a steal. Get one quickly if you care about your family as much as I do.\n        ", "review_helpful_votes": 36, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 5, "review_source": "https://www.amazon.com/gp/customer-reviews/R3QJ2861O568MZ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2016-12-31", "review_body": "Number one...There all unlocked even the carrier version. Number 2 the phone will never be worth $1500.00\n        ", "review_helpful_votes": 8, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R34Q6MNAZ9A7WQ?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-01-20", "review_body": "For 1300-1500 dollars they can keep the phone! I nor would anyone else shell out laptop money for a phone. Good luck selling those babies!\n        ", "review_helpful_votes": 6, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/R1D7V42WK8JZ6U?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-01-20", "review_body": "If anybody buys a phone at this ripoff price, I've got 2 bridges to sell you.\n        ", "review_helpful_votes": 4, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RC2AA3V00PODG?ASIN=B01M01ZZAC", "price": 316.97}, {"review_date": "2017-02-03", "review_body": "It is a decent phone but not worth 1500 dollars....returned to amazon.\n        ", "review_helpful_votes": 2, "review_title": "\n        ", "article": "Google Pixel XL 128GB Unlocked GSM Phone w/ 12.3MP Camera - Quite Black", "review_rating": 1, "review_source": "https://www.amazon.com/gp/customer-reviews/RN4ZQDYDAQCH4?ASIN=B01M01ZZAC", "price": 316.97}]]