{"config": {"name": "model_1", "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 128], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"mask_zero": false, "output_dim": 64, "name": "embedding_1", "trainable": true, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "input_length": null, "batch_input_shape": [null, null], "embeddings_regularizer": null, "dtype": "float32", "input_dim": 8192}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.2, "trainable": true, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"gamma_constraint": null, "trainable": true, "scale": true, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "conv1d_1", "config": {"kernel_constraint": null, "filters": 32, "padding": "same", "kernel_size": [7], "name": "conv1d_1", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"gamma_constraint": null, "trainable": true, "scale": true, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "conv1d_2", "config": {"kernel_constraint": null, "filters": 32, "padding": "same", "kernel_size": [3], "name": "conv1d_2", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"gamma_constraint": null, "trainable": true, "scale": true, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "conv1d_3", "config": {"kernel_constraint": null, "filters": 32, "padding": "same", "kernel_size": [3], "name": "conv1d_3", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"gamma_constraint": null, "trainable": true, "scale": true, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "conv1d_4", "config": {"kernel_constraint": null, "filters": 32, "padding": "same", "kernel_size": [3], "name": "conv1d_4", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv1d_5", "config": {"kernel_constraint": null, "filters": 2, "padding": "valid", "kernel_size": [1], "name": "conv1d_5", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1]}, "class_name": "Conv1D", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "global_average_pooling1d_1", "config": {"name": "global_average_pooling1d_1", "trainable": true}, "class_name": "GlobalAveragePooling1D", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["global_average_pooling1d_1", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model"}